; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	thermograph4 - mode
	spectrograph2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star8 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 GroundStation3)
	(have_image Star10 spectrograph1)
	(have_image Star11 thermograph4)
	(have_image Star12 spectrograph1)
	(have_image Star13 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation3 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 5
3. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation3 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 5
6. (turn_to satellite0 star10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star10)
   goals met: 0 of 5
7. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 1 of 5
8. (turn_to satellite0 groundstation3 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 5
9. (turn_to satellite0 star11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star11)
   goals met: 1 of 5
10. (take_image satellite0 star11 instrument0 thermograph4)
   added: (have_image star11 thermograph4)
   goals met: 2 of 5
11. (turn_to satellite0 groundstation3 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation3)
   goals met: 3 of 5
12. (turn_to satellite0 star12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star12)
   goals met: 2 of 5
13. (take_image satellite0 star12 instrument0 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 3 of 5
14. (turn_to satellite0 groundstation3 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation3)
   goals met: 4 of 5
15. (turn_to satellite0 star13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star13)
   goals met: 3 of 5
16. (take_image satellite0 star13 instrument0 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 4 of 5
17. (turn_to satellite0 groundstation3 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation3)
   goals met: 5 of 5
